{
  "episodes": [
    {
      "TITLE": "Todo Mundo Odeia o Chris",
      "DESCRIPTION": "Chris Rock completa 13 anos e a família Rock muda-se para a Bed-Stuy (Bedford-Stuyvesant), um distrito nova-iorquino do Brooklyn. A mãe dele, Rochelle Rock, matricula-o na \"Escola Secundária Corleone\", que fica em Brooklin Beach e é freqüentada por brancos. Ela acha que lá ele receberá uma educação de melhor qualidade do que nas escolas do bairro. Logo no primeiro dia de aula, ele acaba brigando com Joey Caruso, o valentão da escola. Ele também acaba conhecendo Greg Wuliger, que logo se torna seu amigo. No fim do dia, ele se mete em mais uma confusão: Ele acaba comendo o maior pedaço de frango do jantar, fazendo com que seu pai, Julius, acabe indo trabalhar com fome.",
      "SEASON": 1,
      "NUMBER": 1
    },
    {
      "TITLE": "Todo Mundo Odeia Keisha",
      "DESCRIPTION": "Chris tem uma queda por Keisha, filha de Sheila, para quem Rochelle alugou o apartamento vizinho ao deles. Quando Rochelle pede a Keisha para ajudar Drew em matemática,  Chris tenta impressioná-la, mas tem o coração partido quando flagra Drew beijando-a. Ao mesmo tempo, Julius se sente péssimo depois de dar uma palmada no bumbum de Sheila, achando que ela era Rochelle. Ele passa a achar que está se sentindo atraído por ela. Enquanto isso, Dr. Raymond, o Diretor da Corleone, manda Caruso ficar longe de Chris, o que faz Greg se aproximar mais dele.",
      "SEASON": 1,
      "NUMBER": 2
    },
    {
      "TITLE": "Todo Mundo Odeia Basquetebol",
      "DESCRIPTION": "Chris entra para o time de basquete da escola logo após o Treinador Brady vê-lo jogando uma bolinha de papel no cesto de lixo. O único problema é que ele não sabe jogar. Mesmo sabendo que vai se dar mal, Chris continua fingindo saber de alguma coisa, tudo para continuar popular, mas isso acaba o afastando de Greg e fazendo ele se dar mal no Teste Surpresa de Ciências. Ele é chamado para refazer o teste, pois se não passar, não poderá jogar no time no próximo jogo. A fim de sair do time, ele responde tudo errado, mas sua professora faz ele passar somente por ele ser do time. Ele acaba tendo que ir ao jogo, e assim, ele passa o maior vexame.",
      "SEASON": 1,
      "NUMBER": 3
    },
    {
      "TITLE": "Todo Mundo Odeia Linguiça",
      "DESCRIPTION": "Dr. Raymond coloca Chris na detenção por três dias devido um boato surgido na escola de que ele teria batido em Caruso. Ele fica com medo e não diz nada a Rochelle. Enquanto isso, depois de sofrer por ter que comer uma \"refeição vegetariana\" por que não havia dinheiro suficiente para comprar carne, Julius compra uma grande caixa de linguiça, que será o jantar da semana inteira. No entanto, Tonya recusa-se a comê-las, causando uma briga entre ela e Rochelle. Por isso, Julius tenta ser gentil com a filha para fazê-la comer as salsichas. Mesmo assim, Tonya ainda não aceita comê-las, e por isso, Rochelle tenta forçar as linguiças goela abaixo na filha. Julius, Chris e Drew acabam impedindo-a.",
      "SEASON": 1,
      "NUMBER": 4
    },
    {
      "TITLE": "Todo Mundo Odeia Mikão",
      "DESCRIPTION": "Chris fica amigo de Mikão, um garoto do bairro, quando ele o protege de alguns bandidos que tentam assaltá-lo. Logo, ele empresta sua bicicleta nova ao amigo, mesmo sua mãe tendo o aconselhado a não emprestá-la a ninguém, já que a antiga foi roubada dessa forma. Mikão some com a bicicleta de Chris e deixa-o desesperado. Enquanto isso, Julius fica sem trabalhar devido uma greve dos caminhoneiros e passa as fazer todas as tarefas de casa. Rochelle enlouquece com isso, já que o marido consegue fazer as mesmas tarefas que ela faz, só que muito melhor. Julius nota isso e para deixar a mulher feliz outra vez, pede aos filhos que bagunçem todo o apartamento. Logo depois, Mikão volta e devolve a bicicleta a Chris, e explica que só sumiu com ela pois não queria encrencar o amigo, já que Rochelle havia dito para ele não emprestá-la a ninguém.\nAusente: Vincent Martella como Greg Wuliger.Participação especial: Myzel Robinson como MikãoCo-participação: Kevontay Jackson como JeromeNotas: Esta é a primeira vez em que o personagem Jerome, interpretado por Kevontay Jackson, aparece no seriado",
      "SEASON": 1,
      "NUMBER": 5
    },
    {
      "TITLE": "Todo Mundo Odeia Halloween",
      "DESCRIPTION": "Rochelle manda Chris acompanhar os irmãos enquanto eles pedem doçes no Halloween depois que ele voltar da escola. Quando Keisha convida Drew para a festa de sua amiga Lisa, Chris decide ir no lugar do irmão. O único problema é que ele acaba perdendo o endereço durante a volta para casa, depois de ser \"bombardeado\" com ovos no ônibus. Logo, ele pede a mãe para ir e ela deixa, mas ela pede que ele deixe o número do telefone e o endereço do local. Como ele não consegue recuperar os dados, ele acaba anotando qualquer coisa, e indo com Jerome para o local com uma fantasia de Prince. Mais tarde, ele leva um fora de Keisha na festa ao convidá-la para dançar, e acaba dançando com Lisa. Ao mesmo tempo, Sheila fala com Rochelle sobre a festa e ela decide ligar para o local. Quando um homem atende e diz falar de um local chamado \"Bebidas Shabazz\", ela fica enfurecida com o filho. Enquanto isso, Julius compra os doces do Halloween de marcas genéricas, fazendo com que Rochelle fique chateada e vá ela mesma comprar os doces, só que desta vez de marcas originais.",
      "SEASON": 1,
      "NUMBER": 6
    },
    {
      "TITLE": "Todo Mundo Odeia a Babá",
      "DESCRIPTION": "Julius e Rochelle planejam uma noite romântica, na qual decidem que vão jantar fora. Então, eles contratam a babá de Sheila, Ivete, para cuidar de Chris, Drew e Tonya, já que Chris só pode cuidar dos irmãos de dia. No entanto, Chris acaba sendo uma babá, pois Ivete sai várias vezes para resolver seus problemas. Enquanto isso, o restaurante onde Julius e Rochelle estão jantando é assaltado por dois bandidos, porém, Rochelle descobre que conhece um deles. Logo após, ao chegarem em casa e perguntarem se está tudo bem, Rochelle e Julius ouvem toda a verdade quando Chris conta tudo, já que ele não aguenta mais.\nAusente: Vincent Martella como Greg Wuliger.Participação especial: Erica Hubbard como IveteCo-participações: Bee-Be Smith como Sra. Sanders, Sean Rector como Assaltante #1, Kelvin Brown como Assaltante #2, Mario Sarpong como Mario e Sam Sarpong como Marlon",
      "SEASON": 1,
      "NUMBER": 7
    },
    {
      "TITLE": "Todo Mundo Odeia a Lavanderia",
      "DESCRIPTION": "Julius e Rochelle saem para comprar uma televisão nova na manhã de sábado, e Rochelle manda Chris ir a lavanderia para por as roupas de todos para lavar. Ao chegar lá, Chris passa por vários apuros. Ele se dá mal quando dorme e não é avisado pelos irmãos sobre alguma máquina vazia, quando Tonya gastas as moedas para a máquina, quando ele perde as roupas e principalmente quando Tonya foge.\nCo-participações: Kevontay Jackson como Jerome e Jeris Poindexter como Golpe Baixo",
      "SEASON": 1,
      "NUMBER": 8
    },
    {
      "TITLE": "Todo Mundo Odeia Comida de Ticket",
      "DESCRIPTION": "Julius encontra 200 dólares em ticket alimentação e manda Rochelle fazer o mercardo com eles. Durante as compras, ela encontra com a amiga, Sheila, e fica com vergonha de usar os tickets, e então paga a feira com dinheiro. Ela se mete em uma encrenca, pois Julius diz que quer usar o dinheiro que sobrou (e que ela já gastou) para sair. Por isso, ela tenta vender os tickets para recuperar o dinheiro. Enquanto isso, Chris e Greg discutem devido o trabalho de ciências, que Greg leva muito a sério.",
      "SEASON": 1,
      "NUMBER": 9
    },
    {
      "TITLE": "Todo Mundo Odeia Greg",
      "DESCRIPTION": "Tonya está sempre culpando Chris por tudo só para ele se encrencar. Desta vez, ela o culpa de quase incendiar a casa ao tentar fazer chocolate quente, mesmo ele estando apenas ensinando-a como se faz na hora em que sua mãe apareceu. Logo depois, Greg convida Chris para jogar \"Atari\" em sua casa, mas o pai dele chega, e Chris tem que se esconder no armário. Chris foge de lá e Greg e seu pai vão atrás dele. Ao deixá-lo em casa, o pai de Greg discute com Julius, o que faz com que Chris fique de castigo e não possa ir a casa do amigo. Como Greg não foi proibido de ir a casa de Chris, ele vai lá e eles se divertem muito juntos. Então, Julius vai deixá-lo em casa. Lá, ele e o pai de Greg fazem as pazes. Por fim, ao tentar ajudar Tonya com o chocolate quente outra vez, Chris (novamente) se dá mal.",
      "SEASON": 1,
      "NUMBER": 10
    },
    {
      "TITLE": "Todo Mundo Odeia Natal",
      "DESCRIPTION": "No Natal, o aquecedor de água quebra antes de Rochelle e Julius comprarem o presente de Chris, e então, ela se esforça para dar um presente ao filho mesmo sem dinheiro. Na escola, a Srta. Morello inicia uma campanha para arrecadar alimentos para famílias carentes, e Chris fica surpreso ao saber para quem são esses alimentos. Enquanto isso, Drew revela a Tonya quem realmente põe os presentes de natal embaixo da árvore.",
      "SEASON": 1,
      "NUMBER": 11
    },
    {
      "TITLE": "Todo Mundo Odeia Emprego Temporário",
      "DESCRIPTION": "Quando Chris precisa de 50 dólares para comprar uma jaqueta de couro que, segundo ele, lhe dará \"status\", Julius sugere que o filho trabalhe entregando jornais de madrugada com ele. Depois de trabalhar duro, Chris passa a dar valor ao trabalho do pai. Enquanto isso, a escola de Drew e Tonya é fechada para re-pintura, e eles ficam em casa. Sem tem o que fazer, eles criam um jogo de desafios, que termina quando Tonya vai parar no pronto-socorro por ter tomado um \"milkshake de pimenta\" preparado por Drew. No final do episódio, Chris acaba conseguindo comprar a jaqueta, só que apenas no verão, quando o tempo está muito quente e ele não precisa mais usá-la. Mesmo assim, para impressionar Keisha, ela a usa, e acaba passando mal devido o calor.",
      "SEASON": 1,
      "NUMBER": 12
    },
    {
      "TITLE": "Todo Mundo Odeia Tirar Foto",
      "DESCRIPTION": "O dia da foto na escola se aproxima, e Chris não quer usar as roupas velhas de Drew. Por isso, ele pede a ajuda de sua mãe para encontrar a roupa \"perfeita\". Ela compra uma roupa muito bonita para ele, só que, quando ele guarda a roupa no armário da escola para fazer a educação física, Caruso arromba o armário e rouba a roupa. Para tentar resolver o problema, Chris pega roupas do \"Achados e Perdidos\", porém, os donos das roupas as pedem de volta. Ele procura roupas no teatro, e acaba se vestindo de jockey. Enquanto isso, Rochelle passa vender cosméticos \"Ivone\" para ajudar na renda da família, porém, ela tem dificuldades no início. Por fim, ela acaba vendendo tudo e tendo um bom lucro. Ao mesmo tempo, Tonya quebra o carrinho de Drew ao mexer em suas coisas, e, para se vingar, Drew esconde um dos sapatos de Tonya, justamente o que ela ia usar no dia da foto, o que a faz enlouquecer à procura dele. Para reaver o sapato, ela precisa pedir desculpas ao irmão por ter mexido em suas coisas.",
      "SEASON": 1,
      "NUMBER": 13
    },
    {
      "TITLE": "Todo Mundo Odeia o Dia dos Namorados",
      "DESCRIPTION": "É o Dia dos Namorados, e Caruso aborrece Chris colocando cartões pejorativos em seu armário. No ônibus, Chris ajuda uma garota que havia sido empurrada pelo namorado, com quem ela havia acabado de terminar. Por isso, a garota dá a Chris um cartão do Dia dos Namorados, o que faz ele achar que ela está apaixonada por ele. Enquanto isso, Drew recebe presentes e telefonemas de muitas garotas, o que deixa Rochelle irritada. Ao mesmo tempo, Julius se torna uma \"ameaça\" na escola após assustar o namoradinho de Tonya, chamado James.",
      "SEASON": 1,
      "NUMBER": 14
    },
    {
      "TITLE": "Todo Mundo Odeia a Loteria",
      "DESCRIPTION": "Chris descobre que alguém bateu o seu recorde no game \"Asteroids\", o que pode arruinar sua fama de \"melhor jogador de Asteroids da Bed-Stuy\". Por isso, ele tenta retornar ao 1º lugar. Ele faz apostas em dinheiro com o garoto que bateu seu recorde, chegando a pedir dinheiro emprestado a Greg para as tais apostas. Enquanto isso, para cortar custos, Rochelle e Julius fazem um combinado: Ela deve parar de comprar tartarugas de chocolate e ele de apostar na loteria. Julius para de cumprir o combinado quando Chris conta um sonho a ele, que ele usa em uma  aposta. Ele dá dinheiro a Chris para apostar nos números do sonho, sem que Rochelle descubra. No entanto, para pagar o dinheiro devido a Greg, Chris não aposta. Por fim, é anunciado na TV que eles tinham acertado os números. Julius fica muito feliz, isso até descobrir que o filho não fez a aposta.",
      "SEASON": 1,
      "NUMBER": 15
    },
    {
      "TITLE": "Todo Mundo Odeia Gota",
      "DESCRIPTION": "Julius tem uma crise de Gota e para de trabalhar por um tempo. No período em que fica em casa, ele assiste a novela \"The Young and the Restless\", e acaba recebendo visitas das amigas de Rochelle, que estão indo para saber o que acontece a cada capítulo. Isso a deixa extremamente irritada. Enquanto isso, Chris tira notas baixas na escola e, para não levar uma surra, esconde o boletim de Rochelle e passa a enganar a Srta. Morello quando ela pede que a mãe dele assine o boletim. Rochelle descobre e passa a tratar Chris muito bem para que ele se sinta culpado, e por fim, ela e a Srta. Morello desmascaram-o.",
      "SEASON": 1,
      "NUMBER": 16
    },
    {
      "TITLE": "Todo Mundo Odeia Funerais",
      "DESCRIPTION": "O avô de Chris (pai de Rochelle), Gene, falece durante uma visita a família, enquanto come costeletas de porco no jantar e conta uma piada. A família inteira vem visitá-los para o funeral: Maxine, mãe de Rochelle e esposa de Gene, Tia Ratinha, Tio Michael e Tia Charlotte. Após o falecimento do pai, Rochelle passa a agir estranho e perder o controle da situação, o que faz com que Chris decida controlar tudo.",
      "SEASON": 1,
      "NUMBER": 17
    },
    {
      "TITLE": "Todo Mundo Odeia Corleone",
      "DESCRIPTION": "Chris decide que não vai mais aguentar o preconceito que sofre na Corleone e faz de tudo para ser expulso de lá, para que seus pais o mudem de escola. Suas tentativas não dão certo, mas, quando ele joga um livro em Caruso, ele acaba sendo suspenso por ter causado um acidente de trânsito, já que o livro bateu em um carro. Logo, seus pais concordam em colocá-lo na escola do bairro. Ele vai para lá, mas depois de quase levar uma surra, ele decide voltar para a Corleone. Enquanto isso, Julius arranja um emprego como vendedor de peixe que o faz ganhar mais do que seus 2 empregos juntos, porém, ele fede muito, o que faz com que Rochelle mande-o abandonar o emprego.",
      "SEASON": 1,
      "NUMBER": 18
    },
    {
      "TITLE": "Todo Mundo Odeia Drew",
      "DESCRIPTION": "Frustrado por que Drew, apesar de ser o irmão mais novo, é melhor em tudo, Chris decide aprender fazer a aula de Karatê para poder defender os irmãos e se defender. Entretanto, durante uma luta na rua, Chris acaba quebrando o braço de Drew de propósito e o drew sofreu o acidente com o braço dele de propósito. Enquanto isso, Tonya vai ao salão de beleza e ouve fofocas. Quando ela chega em casa conta tudo a Julius, o que o desagrada. No dia seguinte, ela volta ao salão e Rochelle pede que as meninas não fofoquem perto dela, porém, Tonya é quem fofoca, ao contar coisas de casa Enquanto isso, o professor de aula de karatê quebra o braço de Julius de propósito também e Julius sofreu o acidente com o braço dele também de propósito e Julius voltou pra casa e mandou o Chris pedir desculpas ao seu irmão.Drew e Chris conversaram por que o Chris é o irmão mais velho e o Drew mandou o Chris jogar o golpe e o Chris vai tentar e o Drew quebra o braço do Chris de propósito e o Chris sofreu o acidente com o braço dele.",
      "SEASON": 1,
      "NUMBER": 19
    },
    {
      "TITLE": "Todo Mundo Odeia Playboy",
      "DESCRIPTION": "Chris encontra a \"Playboy\" de seu pai enquanto mexe na caixa de ferramentas dele, a procura de cola para pôr na mesa de jantar. Logo, ele leva a revista para Greg ver na escola e, de repente, todos os garotos querem pagar para vê-la. Caruso rouba a revista e vende para um garoto da 8ª série, e então, Chris toma a revista do garoto e sai correndo. Ao entrar na escola, ele esbarra na Diretora e ela vê a revista. Como ela não sabe de quem é a revista, acaba confiscando-a. Chris tenta comprar outra revista e não consegue, então, tenta roubar a outra da sala da Diretora, com a ajuda de Greg. Ele é flagrado e seus pais são chamados. Enquanto isso, Tonya descobre que Drew tem medo de aranhas e passa a aterrorizá-lo e o Drew descobre que a Tonya tem medo de palhaços e passa a aterrorizá-lo. Rochelle e Julius conversaram com a diretora que alguém levou para escola acha que foi o Chris pegou uma Playboy e Rochelle manda Chris pra casa e Julius avisa pro Chris que não deve mexer nas caixas de ferramentas e não pegar a revista do outros.",
      "SEASON": 1,
      "NUMBER": 20
    },
    {
      "TITLE": "Todo Mundo Odeia A Prisao",
      "DESCRIPTION": "Chris e toda sua turma começam a vender biscoitos parra arrecadar dinheiro para ir a um passeio da escola para Washington. Ele não consegue vendê-los e então começa a apelar, dizendo nas ruas que os biscoitos \"caíram do caminhão\". Ele acaba sendo preso por isso. Enquanto isso, Julius planeja ver \"Dreamgirls\" em seu aniversário de casamento com Rochelle mas Drew e Tonya pegam catapóra. Então, ele diz a Rochelle para ela ir com uma amiga, mesmo sem querer isso de verdade, e Rochelle vai. Em seguida, ele vai com os outros filhos pegar Chris na cadeia. Quando Rochelle chega, ela e Julius se desentendem, mas, ao revelar que comprou ingressos para uma luta ao marido, eles fazem as pazes. Por fim, Chris consegue vender os biscoitos antes de seu pai tirá-lo da cadeia, mas, quando vai para a viagem, descobre que pegou catapora.",
      "SEASON": 1,
      "NUMBER": 21
    },
    {
      "TITLE": "Todo Mundo Odeia o Dia dos Pais",
      "DESCRIPTION": "O Dia dos Pais chega e Chris procura um presente perfeito para Julius. Julius diz que, se ele quiser dar um bom presente, ele deve pagar uma conta. Ao mesmo tempo, ele diz que prefere que seu presente seja passar um dia inteiro sozinho em casa, o que irrita Rochelle. Depois de um tempo, Julius percebe que passar o dia sem a família é muito ruim. No final, Chris não encontra nada que combine com o pai, então, como presente, resolve pagar uma conta, o que deixa Julius e Rochelle muito orgulhosos.\nCo-participações: Antonio Fargas como Sr. Harris e Michael Estime como Perigo",
      "SEASON": 1,
      "NUMBER": 22
    },
    {
      "TITLE": "Todo Mundo Odeia Rejeição",
      "DESCRIPTION": "Quando Keisha se muda para a Flórida, Chris se apaixona por uma nova vizinha: Iveth, que, segundo Drew, \"fica com qualquer cara\". Disposto a conquistá-la, Chris a convida para ir ao cinema e para ir a um show, mas descobre que ela só está interessada nos ingressos, e não nele próprio. No final do episódio, Chris conhece Tasha, neta de Louise Clarkson, uma mulher implicante que funda uma Patrulha Civil no bairro.",
      "SEASON": 2,
      "NUMBER": 1
    },
    {
      "TITLE": "Todo Mundo Odeia O Presidente do Grêmio",
      "DESCRIPTION": "Chris se candidata a presidente do grêmio escolar, e concorre contra Caruso. Julius descobre que tem hipertensão e tenta diminuir o stress em sua vida. Tonya pede ajuda a Drew para fazer o moonwalk, que ela afirma ser inventado pelo Billy Ocean.",
      "SEASON": 2,
      "NUMBER": 2
    },
    {
      "TITLE": "Todo Mundo Odeia Eleições",
      "DESCRIPTION": "Em tempos de votação para ser presidente, Chris tenta escrever um discurso para se eleger, mas o discurso é roubado por Caruso. Drew acha e gasta o dinheiro que sua mãe perdeu. Rochelle aluga o apartamento de cima para o Sr. Omar, diretor de funerais Rycher ajuda Julios com pagamento!",
      "SEASON": 2,
      "NUMBER": 3
    },
    {
      "TITLE": "Todo Mundo Odeia Um Mentiroso",
      "DESCRIPTION": "Chris faz com que todo mundo pense que ele está namorando Tasha. Mas seu plano da errado pois a vó da garota acaba contando a Rochelle a novidade. Julius troca os seus selos tentando comprar uma geladeira. Drew conta para a mãe por que ela dá mais atenção no Chris e na Tonya do que nele.",
      "SEASON": 2,
      "NUMBER": 4
    },
    {
      "TITLE": "Todo Mundo Odeia Malvo",
      "DESCRIPTION": "A loja de Doc é roubada por Malvo enquanto Chris está no caixa. Malvo ameaça Chris de morte se ele o denunciar à polícia. Mas Chris perde o emprego por não revelar pro Doc. Enquanto isso, Julius compra um Betamax, um antigo aparelho que grava a novela The Young and the Restless, mas ele fica furioso com Tonya, pois ela grava desenhos animados no lugar de sua novela.",
      "SEASON": 2,
      "NUMBER": 5
    },
    {
      "TITLE": "Todo Mundo Odeia Sistema de Parceiragem",
      "DESCRIPTION": "Por determinação do diretor Edwards, Chris e Caruso precisam ser parceiros em um passeio escolar. Perdem o ônibus da escola na volta do museu, e são forçados a conviver enquanto andam de metrô por Nova Iorque inteira. Tonya perde um brinco de Rochelle e Julius sai à procura de uma camiseta do jogador de hóquei Wayne Gretzky, para dá-la de presente a Drew.",
      "SEASON": 2,
      "NUMBER": 6
    },
    {
      "TITLE": "Todo Mundo Odeia Promessas",
      "DESCRIPTION": "Estudantes querem que Chris renuncie o cargo de presidente do grêmio escolar depois de não ter cumprido as promessas de campanha. Chris se vê em maus lençóis – mas não tanto quanto seus pais, que têm que aturar a visita do tio Mike, que brigou com a mãe.",
      "SEASON": 2,
      "NUMBER": 7
    },
    {
      "TITLE": "Todo Mundo Odeia O Feriado",
      "DESCRIPTION": "É feriado de Ação de Graças e Julius quer causar boa impressão em seu irmão Louis e nos vizinhos. Por isso, acorda a família às 5 da manhã e estabelece tarefas para a arrumação da casa e o preparo do jantar. No fim do dia, quase todos os personagens se reúnem na casa de Chris para a comemoração e cada um contribui a seu modo – principalmente Doc, que ajuda Chris num trabalho escolar sobre a data.",
      "SEASON": 2,
      "NUMBER": 8
    },
    {
      "TITLE": "Todo Mundo Odeia Superstição",
      "DESCRIPTION": "Coisas boas começam a acontecer no caminho de Chris para a escola no dia em que ele veste a meia da sorte de seu pai. Em casa, Drew insiste com seus pais para ganhar um terno que usará num show de talentos, e Tonya pede um tapete cor de rosa para decorar seu quarto, pois, segundo ela, Billy Ocean tem um tapete rosa.",
      "SEASON": 2,
      "NUMBER": 9
    },
    {
      "TITLE": "Todo Mundo Odeia Papai Noel",
      "DESCRIPTION": "Desejando ganhar uma renda extra no fim de ano, Julius começa a trabalhar como Papai Noel numa loja de departamentos. Chris é seu duende assistente. O Papai Noel negro alerta às crianças sobre como os presentes que desejam são caros, e fala que elas certamente não os ganharão. Isso resulta em sua demissão. Chris fica muito doente devido ao frio da cidade e devido a ter dois empregos, como o pai. É internado e, no hospital, conhece um misterioso homem chamado Kris (Richard Lewis), que ajuda o garoto a valorizar o que tem e descobrir o lado bom das coisas. Na tradução em português, Kris recebe o nome de Noel, para que não haja confusão entre Kris e Chris, nomes que em inglês têm pronúncias diferentes mas em português são quase iguais.",
      "SEASON": 2,
      "NUMBER": 10
    },
    {
      "TITLE": "Todo Mundo Odeia Ovos",
      "DESCRIPTION": "Srta. Morello distribui ovos para os alunos, e cada um deve cuidar do seu ovo como se fosse um bebê (detalhe: o ovo de Chris é um ovo marrom). Chris pensa que o trabalho seria moleza, mas Rochelle faz com que ele dê duro para cuidar do pequeno ovo. A conta de luz fica cara e Julius descobre que Tonya dorme de luz acesa pois Drew disse pra ela que ele vira lobisomem.",
      "SEASON": 2,
      "NUMBER": 11
    },
    {
      "TITLE": "Todo Mundo Odeia Os Inspetores",
      "DESCRIPTION": "Chris é nomeado inspetor escolar, com a função de zelar pela disciplina dos alunos – mas ninguém o respeita. Na Bed-Stuy, Tonya está furiosa porque convidou suas amigas para brincar em sua casa e elas só dão atenção para Drew. Rochelle reclama do trabalho no escritório para Julius.",
      "SEASON": 2,
      "NUMBER": 12
    },
    {
      "TITLE": "Todo Mundo Odeia O Inverno",
      "DESCRIPTION": "Num dia de terrível nevasca, Chris é o único que vai para o colégio. Lá, o diretor Edwards não o deixa ir embora até que o tempo melhore. Mas Julius vai atrás do filho. Já Rochelle é roubada no metrô, impressionando o ladrão por causa do seu jeito de ser.",
      "SEASON": 2,
      "NUMBER": 13
    },
    {
      "TITLE": "Todo Mundo Odeia O Substituto",
      "DESCRIPTION": "Srta Morello viaja para a África e então, um professor substituto negro (Orlando Jones) começa a dar aulas. O professor espera mais de Chris, e torna a sua vida complicada. Enquanto isso, Tonya consegue tudo o que ela quer acusando que Drew bateu nela, mas depois, Rochelle descobre que a garota estava mentindo. Julius está furioso com o Sr. Omar, pois ele está usando o telefone de sua casa, para ligar para as viúvas.",
      "SEASON": 2,
      "NUMBER": 14
    },
    {
      "TITLE": "Todo Mundo Odeia Matar Aula",
      "DESCRIPTION": "Ao saberem que a Srta. Morello, faltará à escola, Chris e Greg decidem matar aula para ir ao cinema assistir os Caça-Fantasmas. Na escola local de Drew e Tonya, acontece uma feira literária e Rochelle trabalha como voluntária, e graças ao seu jeito “delicado” acaba sendo expulsa. Já o patriarca dos Rock se estressa no centro da cidade ao tentar renovar a carteira de habilitação.",
      "SEASON": 2,
      "NUMBER": 15
    },
    {
      "TITLE": "Todo Mundo Odeia Roubar Correntes",
      "DESCRIPTION": "Ao ver que Malvo iria roubar a corrente de ouro de Vanessa, Chris alerta a amiga e impede o furto. Malvo fica furioso e ordena que Chris deverá trazer-lhe uma corrente de ouro ou irá apanhar. Rochelle se enfurece quando descobre que Julius tem um cartão de crédito há 15 anos, e desconfia que ele tem uma amante. Já Tonya fica pendurada no telefone tentando conseguir uma ligação promocional que lhe garanta ingressos para o show de Billy Ocean.",
      "SEASON": 2,
      "NUMBER": 16
    },
    {
      "TITLE": "Todo Mundo Odeia DJ's",
      "DESCRIPTION": "Chris é chamado para substituir um DJ numa festa – o motivo: o DJ está “em cana”. Às vésperas da festa, Chris precisa comprar os caríssimos equipamentos de DJ e, sem querer, estraga um dos discos preferidos de sua mãe, The Great Payback de James Brown. Neste episódio, Julius revela seu grande trauma: tem medo de coelhos.",
      "SEASON": 2,
      "NUMBER": 17
    },
    {
      "TITLE": "Todo Mundo Odeia Beisebol",
      "DESCRIPTION": "Chris tem que decidir entre assistir ao jogo de beisebol dos New York Mets vs Los Angeles Dodgers com o pai, ou ir ao cinema ver “De volta para o futuro” com Tasha. Enquanto isso, Tonya inscreve-se no fã clube do Billy Ocean, a fim de ganhar uma foto autografada do astro, mas Rochelle perde a carta da menina em sua bolsa. Rochelle tenta impedir Vanessa de sair com Mike.",
      "SEASON": 2,
      "NUMBER": 18
    },
    {
      "TITLE": "Todo Mundo Odeia Apostar",
      "DESCRIPTION": "Chris se torna um nato palpiteiro acertando os jogos da NBA na loja do Doc. Julius também aposta sem saber que é seu filho que está dano os tiros. Drew e Tonya apostam em um jogo de damas. Rochelle descobre que Chris é o apostador em jogos de basquete, no final quase todos terminam encrencados.",
      "SEASON": 2,
      "NUMBER": 19
    },
    {
      "TITLE": "Todo Mundo Odeia Piadas Sujas",
      "DESCRIPTION": "Chris começa a ouvir secretamente piadas sujas e ele descobre que contar piadas seria um ponto para ser popular. Enquanto isso, Rochelle tenta achar um namorado para a mãe. Drew rejeita uma garota por causa de sua altura.",
      "SEASON": 2,
      "NUMBER": 20
    },
    {
      "TITLE": "Todo Mundo Odeia Matemática",
      "DESCRIPTION": "Chris tem um problema em aprender álgebra, então Rochelle tenta ensinar a ele. Mas devido à pouca paciência da mãe, Chris procura sua avó, uma professora aposentada. Drew quebra a cadeira de Julius e Tonya ordena que ele faça tudo que ela mandar, senão vai contar tudo para Julius. Perigo arruma um emprego de vendedor de jornais junto com Julius.",
      "SEASON": 2,
      "NUMBER": 21
    },
    {
      "TITLE": "Todo Mundo Odeia O Último Dia",
      "DESCRIPTION": "É o último dia de aula e Chris deseja se vingar de Caruso. Enquanto isso, Julius tenta desentupir a pia da casa do sr. Omar, mas acaba por destruí-la. Drew usa uma beca secretamente de Rochelle e Tonya a suja de sorvete.",
      "SEASON": 2,
      "NUMBER": 22
    },
    {
      "TITLE": "Todo Mundo Odeia O Orientador",
      "DESCRIPTION": "Chris está mal de notas e tem que ficar frente a frente com o orientador escolar (interpretado pelo próprio ator Chris Rock). Enquanto isso, Julius arranja roupa nova para os filhos.",
      "SEASON": 3,
      "NUMBER": 1
    },
    {
      "TITLE": "Todo Mundo Odeia O Caruso",
      "DESCRIPTION": "Caruso apanha de um aluno do Corleone, e perde toda a moral de valentão, então Chris tenta fazer com que ele volte a ser o valentão de sempre. Enquanto isso, Julius tenta arrumar um trabalho, escondido de Rochelle, enquanto está de folga, mas acaba sendo descoberto por Drew e Tonya, que acabam contando para a mãe.",
      "SEASON": 3,
      "NUMBER": 2
    },
    {
      "TITLE": "Todo Mundo Odeia Dirigir",
      "DESCRIPTION": "Julius deixa Chris dirigir o carro da família no quarteirão, porém Chris vai até a escola, tentando impressionar Tasha. Enquanto isso, Rochelle vai a um tribunal, pois ela estava andando em alta velocidade e acaba sendo absolvida, mas no final acaba pagando oitenta dólares de multa por desacato à autoridade por ter feito a \"dancinha da vitória\".",
      "SEASON": 3,
      "NUMBER": 3
    },
    {
      "TITLE": "Todo Mundo Odeia O Cachorro",
      "DESCRIPTION": "A casa da família Rock é roubada, e então Chris sugere que comprem um cão de guarda para proteger a casa. Julius e Rochelle permitem, mas será Chris que deverá cuidar do cachorro, que recebe o nome de Neguinho. Enquanto isso, Julius e Rochelle recorrem ao seguro de eletrodomésticos, na tentativa de recuperar os móveis perdidos. Já Drew e Tonya, se divertem passando trotes telefônicos.",
      "SEASON": 3,
      "NUMBER": 4
    },
    {
      "TITLE": "Todo Mundo Odeia Casa de Solteiro",
      "DESCRIPTION": "Todos na casa de Chris estão doentes, então ele irá passar uns dias na casa do senhor Omar. Tonya finge que está doente, porque esqueceu de estudar para a prova de matemática, e está com medo que Rochelle descubra. Na escola, Greg sugere que Chris convide Tasha para que os dois ficam sozinhos em casa. Mas as coisas saem fora de controle quando a noticia de sua independência se espalha.",
      "SEASON": 3,
      "NUMBER": 5
    },
    {
      "TITLE": "Todo Mundo Odeia Bed-Stuy",
      "DESCRIPTION": "Chris percebe que não fez nada de importante nos últimos anos na escola, e então decide entrar para o grupo do jornal. Mas ele não sabe sobre o que escrever. Então, inventa uma história sobre um serial killer e acaba causando pânico no bairro. Enquanto isso, Rochelle pretende votar em Lamar Jhonson e faz campanhas sobre seu governo; entretanto, Sr. Omar é contra as ideias de Rochelle.",
      "SEASON": 3,
      "NUMBER": 6
    },
    {
      "TITLE": "Todo Mundo Odeia Hóspedes",
      "DESCRIPTION": "Art Wulliger está viajando, e Greg vai dormir na casa de Chris, onde recebe tratamento especial de Rochelle, deixando Chris enciumado. Julius está trabalhando como taxista e um homem chamado Eddie quer que ele o leve para Las Vegas por mil dólares. Só que Eddie é um ladrão de banco e rouba todos os lugares que eles pararam durante a viagem.",
      "SEASON": 3,
      "NUMBER": 7
    },
    {
      "TITLE": "Todo Mundo Odeia Salário Mínimo",
      "DESCRIPTION": "Chris se demite do emprego na loja do Doc e arruma um emprego em um restaurante chinês. Drew quase fica reprovado e Julius decide falar com a professora e descobre na hora porque Drew estava indo mal. Enquanto isso, Rochelle entra em um desfile de cabelos, promovido por Vanessa, e as meninas do salão fazem um penteado em forma de tsunami em seu cabelo.",
      "SEASON": 3,
      "NUMBER": 8
    },
    {
      "TITLE": "Todo Mundo Odeia O Novato",
      "DESCRIPTION": "Chris está feliz porque um novo menino negro chamado Albert chegou em sua escola, mas Greg está furioso porque está sendo rejeitado por Chris. Rochelle descobre que a receita devolveu o dinheiro do imposto de renda, e veio o dobro do esperado. Então, ela compra um sofá novo e cereais para a familia. Mas, Drew e Tonya estão brigando por causa dos cereais e Julius está com medo de que a receita pegue o dinheiro da devolução de volta.",
      "SEASON": 3,
      "NUMBER": 9
    },
    {
      "TITLE": "Todo Mundo Odeia Kwanzaa",
      "DESCRIPTION": "Chris precisa fazer um trabalho escolar: precisa ajudar pessoas necessitadas e descobre que a mãe de Golpe Baixo é da alta sociedade. E Julius descobre que é mais barato celebrar o Kwanzaa (cerimônia africana) do que o Natal.",
      "SEASON": 3,
      "NUMBER": 10
    },
    {
      "TITLE": "Todo Mundo Odeia A Rodoviária",
      "DESCRIPTION": "Chris e sua família decidem viajar para o sul, assim indo no velório de um parente distante de Julius. Inconfortáveis, enquanto o ônibus não parte, Chris e seu pai entram em um esquema de jogatina e ficam com medo de contar a Rochelle que perderam todo o dinheiro.",
      "SEASON": 3,
      "NUMBER": 11
    },
    {
      "TITLE": "Todo Mundo Odeia Bad Boys",
      "DESCRIPTION": "Chris vira um bad boy quando descobre que Tasha gosta de garotos maus. Enquanto isso, Julius ganha refeição gratuita para ele e sua família depois de ser o funcionário do mês, mas chegando lá, as coisas não ocorrem como o esperado.",
      "SEASON": 3,
      "NUMBER": 12
    },
    {
      "TITLE": "Todo Mundo Odeia O Primeiro Beijo",
      "DESCRIPTION": "Depois de descobrir que Tasha está indo para a \"jogo da garrafa\", Chris está determinado a obter um convite para que ele possa finalmente ter seu primeiro beijo. Quando Rochelle conversa com um antigo namorado Julius se torna extremamente ciumento e pede a Tonya que espie sua mãe para saber se ela ainda tem sentimentos por ele. Sr. Omar utiliza cinco dólares de Drew, não percebendo que ele estará decidido a ter seu dinheiro de volta.",
      "SEASON": 3,
      "NUMBER": 13
    },
    {
      "TITLE": "Todo Mundo Odeia A Páscoa",
      "DESCRIPTION": "Quando Tasha rompe-se com seu namorado, Chris fica muito feliz e a convida para ser sua parceira na Páscoa na igreja, mas primeiro ele tem de descobrir o modo de estar em dois lugares ao mesmo tempo sem que Rochelle descubra. Rochelle está confiante que vai ganhar o concurso de chapéus da Páscoa pelo quarto ano consecutivo, mas ela descobre que o mais novo membro da Igreja tem a intenção de retirar seu título. Julius finge que tem de trabalhar na Páscoa, para que ele possa permanecer em casa e assistir ao beisebol. Mas alguns problemas acontecem: Drew torce o tornozelo, Chris não foi achado e Rochelle fica sem um acompanhante para ela.",
      "SEASON": 3,
      "NUMBER": 14
    },
    {
      "TITLE": "Todo Mundo Odeia Gretzky",
      "DESCRIPTION": "Numa tentativa de manter seu irmão, Drew, fora de dificuldade, Chris concorda com relutância em faltar a escola e acompanhar Drew em uma missão para encontrar seu ídolo, Wayne Gretzky. Além disso, Tonya iria, com a escola, em uma viagem a Filadélfia, que foi vencida por Julius porque, segundo ele, era muito caro.",
      "SEASON": 3,
      "NUMBER": 15
    },
    {
      "TITLE": "Todo Mundo Odeia DFN",
      "DESCRIPTION": "Chris está desesperado para levantar fundos para ir a um concerto de Run DMC. Ele falta, devido a uma oportunidade de participar do DFN do Sr. Omar. Entretanto, Rochelle finge que machuca seu braço, a fim de ter um pouco mais de descanso dos trabalhos domésticos.",
      "SEASON": 3,
      "NUMBER": 16
    },
    {
      "TITLE": "Todo Mundo Odeia Ex-Presidiários",
      "DESCRIPTION": "Chris tenta ajudar Malvo, um criminoso que foi libertado recentemente de prisão, porque ele quer voltar para a escola secundária. Julius se sente traído quando Drew diz que é fã do Mets. Enquanto isso, Rochelle se mede com a mãe da Latrinda (amiga da Tonya) que não sabe cuidar da sua filha.",
      "SEASON": 3,
      "NUMBER": 17
    },
    {
      "TITLE": "Todo Mundo Odeia O Dia da Terra",
      "DESCRIPTION": "Chris deve fazer um projeto para a escola do Dia da Terra, por isso ele decide recolher latas, acreditando que será uma tarefa fácil. Rochelle é chamada para ir a escola para discutir sobre o comportamento inadequado de Tonya. Mais tarde, Rochelle promete parar de gritar, mas Julius aposta que isso não durará muito tempo.",
      "SEASON": 3,
      "NUMBER": 18
    },
    {
      "TITLE": "Todo Mundo Odeia Ser Descolado",
      "DESCRIPTION": "Chris está cansado de ser somente um \"nerd\" e tenta se tornar um garoto descolado. Inspira-se nos caras do Fliperama, uma loja de jogos do bairro, e aprende a andar com cigarros atrás da orelha. Entretanto, Chris é capturado e suspenso da escola. Tonya descobre, e evidentemente diz que vai contar a Julius e Rochelle que Chris foi suspenso. Chris pede que não, então ela decide fazer chantagem. Enquanto isso, em um esforço para convencer Julius a dar um fim em um casaco dado a ele por sua ex-namorada, Rochelle decide usar roupas inadequadas pelo bairro.",
      "SEASON": 3,
      "NUMBER": 19
    },
    {
      "TITLE": "Todo Mundo Odeia O Baile da Nona Série",
      "DESCRIPTION": "Chris é o único menino sem uma parceira para o baile de formatura, então Greg sugere que ele peça a Carrie, uma menina tímida, na qual ninguém presta atenção. Carrie aceita ir ao baile com Chris, mas problemas surgem quando as pessoas começam a zombá-los. Enquanto isso, Tonya pede a Rochelle se pode ter aulas de balé. Julius e Drew compram um carro em um leilão, juntamente com Ryan.",
      "SEASON": 3,
      "NUMBER": 20
    },
    {
      "TITLE": "Todo Mundo Odeia O Dia das Mães",
      "DESCRIPTION": "Chris tenta comprar para Rochelle um caro perfume chamado \"Pure Vodoo\" para o Dia das Mães em uma loja, mas ele não consegue, pois é acusado de ter roubado o perfume. Chris compra um perfume falso (Puru Vudu) e Rochelle descobre que é alérgica a ele e surge muitos machucados em seu corpo. Julius e Drew tentam recuperar um boneco Voltron, que vale 150 dólares.",
      "SEASON": 3,
      "NUMBER": 21
    },
    {
      "TITLE": "Todo Mundo Odeia A Formatura",
      "DESCRIPTION": "No dia de formatura Greg diz a Chris que sua mãe o matriculou na Academia de Ciências do Bronx (Bronx High School of Science). Drew e seu tio Ryan (o outro irmão de Julius e interpretado pelo irmão mais novo de verdade do Chris Rock, Tony Rock) fazem uma espécie de feira de \"fitas mix\" e Drew pede para Julius lhe emprestar 100 dólares para começar. Tonya tenta vender ingressos da encenação O Lago dos Cisnes na escola e descobre que seu parceiro quebrou o pé. No final Chris descobre que sua inscrição da Academia de Ciências do Bronx foi negada.",
      "SEASON": 3,
      "NUMBER": 22
    },
    {
      "TITLE": "Todo Mundo Odeia Tattaglia",
      "DESCRIPTION": "A quarta temporada começa com Chris entrando no Tattaglia, em um colégio que possui um professor bastante intolerante com os negros. Enquanto isso, Tonya começa a trabalhar com Rochelle no salão de beleza de Vanessa. Mas as clientes reprovam seus comentários sinceros e acaba sendo demitida, e no final fala a frase característica da mãe: \"Eu não preciso disso, meu pai tem dois empregos!\".",
      "SEASON": 4,
      "NUMBER": 1
    },
    {
      "TITLE": "Todo Mundo Odeia Bolo",
      "DESCRIPTION": "Chris é convidado para ser o tutor de seu colega andrógeno Angel (Hector Garcia), de forma que ele possa obter a atenção de uma outra estudante. Sr. Omar pede para que Drew e Tonya cuidem de seu peixe dourado Herman, durante uma semana; mas eles não podem mexer em nada dentro do apartamento. Peaches (Tisha Campbell-Martin) , a mãe de Tasha, se muda para o apartamento vizinho, após sair da cadeia; gostou muito de Rochelle e tenta ser sua amiga. Greg é expulso da Academia de Ciências do Bronx, e se torna um nerd de novo.",
      "SEASON": 4,
      "NUMBER": 2
    },
    {
      "TITLE": "Todo Mundo Odeia Baile",
      "DESCRIPTION": "Srta. Morello pede a Chris para que Denise Huxtable (Tristin Mays) seja a sua parceira no baile da Tattaglia, já que todos os garotos negros da escola já tinham uma parceira, mas os pais dela, o Dr. Clint Huxtable (Orlando Jones) e sua esposa, Blair Huxtable (Devika Parikh) não aceitam de imediato. Greg, depois de ser expulso da Academia de Ciências do Bronx, resolve sair de Tattaglia também. Assim, ele perde a sua auto-confiança, e Chris o auxilia a recuperar sua auto-estima. Um menino paquera Tonya, o que causa ciúmes em James. Drew substitui Chris no Doc's. As cenas na casa dos Huxtables são inspiradas no The Cosby Show.",
      "SEASON": 4,
      "NUMBER": 3
    },
    {
      "TITLE": "Todo Mundo Odeia A Professora de Literatura",
      "DESCRIPTION": "Julius e Rochelle aumentam o aluguel do Sr. Omar e ele exige reparos ao apartamento. Sendo assim, ele passa um tempo com a sua família até que os reparos sejam feitos. Chris é atribuído por Senhorita Rivero a fazer um relatório sobre o livro O Homem Invisível, mas decide assistir ao filme com o mesmo nome, mas Greg conta a notícia de que o filme que Chris assistiu não tem nada a ver com o livro em si.",
      "SEASON": 4,
      "NUMBER": 4
    },
    {
      "TITLE": "Todo Mundo Odeia O Meu Brother",
      "DESCRIPTION": "Para poder andar com pessoas legais, Chris decide ajudar Dickerson e os outros com a lição de casa, assim ganha o apelido de \"Meu Brother\". O resultado disso é que Chris está tirando notas baixas nos próprios testes. Enquanto isso, Julius começa o trabalho recolhendo os cadáveres para o funeral do Sr. Omar, e começa a ver a vida de um jeito mais feliz, comprando presentes para a família e distribuindo dinheiro para os amigos, e Rochelle fica preocupada com os gastos do marido e exige de Sr. Omar a demissão do marido.",
      "SEASON": 4,
      "NUMBER": 5
    },
    {
      "TITLE": "Todo Mundo Odeia O Doc's",
      "DESCRIPTION": "A nova namorada de Doc, Stacy (Robin Givens), torna a vida de Chris complicada, pois ela é muito exigente. Então ele decide convence-la a romper com Doc. Enquanto isso, um sutiã encontrado na gaveta de meias de Julius torna Rochelle infeliz; no entanto, o que ela não sabe é que Tonya o escondeu na gaveta do pai, pois a garota queria usá-lo para atrair a atenção dos colegas de classe.",
      "SEASON": 4,
      "NUMBER": 6
    },
    {
      "TITLE": "Todo Mundo Odeia X-9",
      "DESCRIPTION": "Chris deveria estar tomando conta de Drew e Tonya em sua casa enquanto seus pais iam assistir \"Showdogs\" (uma paródia ao musical Cats) na Broadway, mas ele escapa e vai ao cinema com amigos e testemunham uma situação crítica fora do cinema. Quando uma recompensa é oferecida para quem viu o crime para não contarem nada à polícia, Chris não consegue se decidir se pega ou não o dinheiro.",
      "SEASON": 4,
      "NUMBER": 7
    },
    {
      "TITLE": "Todo Mundo Odeia Garotas Altas e Magras",
      "DESCRIPTION": "Chris está começando a se acostumar com a nova escola quando a garota mais chata da escola, Kelly, apelidada de \"Garibalda\" (Big Bird ou Garibaldo é personagem da série de televisão Vila Sésamo), o convida para um encontro. Chris apenas concorda em sair com ela porque não quer ferir os sentimentos da menina, mas depois de ficar um pouco juntos, Chris percebe que realmente gosta da garota. Enquanto isso, as mulheres do salão apostam que os Jets irão vencer um jogo de futebol americano, enquanto os homens da barbearia, apostam nos Giants.",
      "SEASON": 4,
      "NUMBER": 8
    },
    {
      "TITLE": "Todo Mundo Odeia O James",
      "DESCRIPTION": "Julius aprende como tratar as mulheres assistindo o programa The Oprah Winfrey Show. Infelizmente, o plano falha quando Rochelle pensa que Julius está com um comportamento estranho e possivelmente tem uma amante. Chris é voluntário do programa \"Irmão de Outra Mãe\", mas é surpreendido ao saber que terá que fingir que James é seu \"irmãozinho\".",
      "SEASON": 4,
      "NUMBER": 9
    },
    {
      "TITLE": "Todo Mundo Odeia Véspera de Ano Novo",
      "DESCRIPTION": "Chris está determinado a passar o Reveillon na Times Square, mas Rochelle diz que ele só poderá ir se arranjar um acompanhante adulto e responsável por ele. O único problema é que as únicas pessoas que Chris encontra para ir com ele são dois ex-condenados, Peaches e Malvo, e lá ele beija a Tasha. Julius interrompe um cara que ia saltar da ponte \"George Washington\" e se torna um herói local nas notícias da noite. Drew e Tonya fazem uma aposta de quem fica mais tempo acordado.",
      "SEASON": 4,
      "NUMBER": 10
    },
    {
      "TITLE": "Todo Mundo Odeia O Sr. Levine",
      "DESCRIPTION": "Quando Rochelle pede uma cópia de sua Certidão de nascimento, ela percebe que é um ano mais nova do que imaginava, então ela resolve viver sua vida com um comportamento mais jovem. Após um estranho proteger Chris durante um apagão na cidade, Chris resolve retribuir ao senhor, o levando para sair e fazer novos amigos. Enquanto isso, Greg acha que não tem uma identidade quando percebe que as pessoas na escola só o conhecem por \"Chris e Greg\".",
      "SEASON": 4,
      "NUMBER": 11
    },
    {
      "TITLE": "Todo Mundo Odeia Lutadores Fracassados",
      "DESCRIPTION": "Chris decide entrar para o time de luta greco-romana para conseguir uma jaqueta do time e impressionar as garotas. Rochelle se esforça para perder peso bebendo uma bebida de emagrecimento, e Julius decide que toda a família deve seguir a dieta, pois ele percebe que é mais barato que comprar verduras, mas este acaba descobrindo que eles comiam outras coisas escondidos quando fragla Rochelle comendo um hambúrguer no banheiro. Drew decide começar um grupo de música só de meninas, mas ele se arrependerá de ter deixado Tonya entrar no grupo.",
      "SEASON": 4,
      "NUMBER": 12
    },
    {
      "TITLE": "Todo Mundo Odeia Identidades Falsas",
      "DESCRIPTION": "Chris e Greg percebem que é melhor arrumarem identidades falsas, ou não puderam ir ao concerto só pra maiores do grupo de Rap Fat Boys. Rochelle planeja uma festa surpresa para Julius. Drew encomenda um par de óculos de Raio-x pelo correio, mas quando ele descobre que eles não funcionam, ele resolve devolver à empresa e responsabilizá-los pela falha.",
      "SEASON": 4,
      "NUMBER": 13
    },
    {
      "TITLE": "Todo Mundo Odeia Exames para Faculdade",
      "DESCRIPTION": "Sabendo que ele precisa tirar uma nota boa para entrar no Ensino Médio, Chris decide se preparar para a PSAT, mas quando Rochelle faz com que toda a família participe de um evento social, Chris fica sem tempo para estudar e tem de recorrer à compra de um gabarito com as respostas da PSAT. Julius ganha um tíquete para trocar por uma televisão nova, mas logo percebe que é uma pegadinha para pessoas que não pagaram o tíquete de estacionamento.",
      "SEASON": 4,
      "NUMBER": 14
    },
    {
      "TITLE": "Todo Mundo Odeia Boxe",
      "DESCRIPTION": "O técnico Thurman vê Chris sendo humilhado e sofrendo bullying por Caruso e sugere que Chris aprenda boxe para se defender. Julius é seduzido por uma mulher bonita da vizinhança, que começa a dar olhadas para ele da janela da casa dela, sem saber que são Drew e vários garotos inclusive seu amigo James que a estavam observando. Julius acha que Rochelle está tendo um caso quando ele acha uma conta de telefone com inúmeras ligações para um número desconhecido à noite.",
      "SEASON": 4,
      "NUMBER": 15
    },
    {
      "TITLE": "Todo Mundo Odeia Lasanha",
      "DESCRIPTION": "Chris concorda, sem vontade, em esconder maconha para um criminoso que estava correndo, mas ele percebe que será difícil achar um lugar que não lhe dê problemas. Enquanto isso, Vanessa insiste que Rochelle precisa aprender a lidar com o novo sistema de computador do salão de beleza com a ajuda de Peaches (mãe de Tasha), que não se dá muito bem com Rochelle.",
      "SEASON": 4,
      "NUMBER": 16
    },
    {
      "TITLE": "Todo Mundo Odeia A Semana da Primavera",
      "DESCRIPTION": "Chris faz um test drive em um carro e acidentalmente atropela Greg, que quebra a perna e vai parar no hospital. Rochelle cancela suas férias na praia para cuidar de Greg por uma semana, porque os pais dele estão fora da cidade, deixando Julius cuidando de Drew e Tonya no litoral, onde chove todo dia.",
      "SEASON": 4,
      "NUMBER": 17
    },
    {
      "TITLE": "Todo Mundo Odeia Carro",
      "DESCRIPTION": "Chris recebe sua carteira de habilitação e compra um carro, o qual é rapidamente roubado. Ele descobre que ter um carro é uma grande responsabilidade, então ele pensa se livrar dele. Enquanto isso, Tonya descobre os cigarros de Rochelle, e os esconde na gaveta de Chris; Rochelle descobre que Julius faz apostas em corridas de cavalo escondido quando ela estava procurando seus cigarros; Julius descobre que Drew possui uma caneta de uma mulher nua, quando estava procurando seu bilhete de apostas em corridas de cavalo.",
      "SEASON": 4,
      "NUMBER": 18
    },
    {
      "TITLE": "Todo Mundo Odeia Lavar a Louça",
      "DESCRIPTION": "Chris fica contra às regras que sua mãe impõe e recusa a realizar as tarefas domésticas, fazendo com que Rochelle tenha que contar para Julius que o filho está a desrespeitando. Enquanto isso, Sr. Omar acredita que está morrendo, então ele sai dizendo qualquer coisa que lhe vem à mente.",
      "SEASON": 4,
      "NUMBER": 19
    },
    {
      "TITLE": "Todo Mundo Odeia Tasha",
      "DESCRIPTION": "Chris pede para Tasha ser sua namorada e fica chocado quando ela concorda. Mas ele também fica surpreso ao descobrir que o fato de ter uma namorada significa sacrificar a maior parte de seu tempo livre. Enquanto isso, Rochelle descobre que Julius já havia se casado antes. Pior ainda, ele não é legalmente divorciado. Drew e Tonya apostam em quem consegue ficar mais tempo sem falar.",
      "SEASON": 4,
      "NUMBER": 20
    },
    {
      "TITLE": "Todo Mundo Odeia Ameaças de Bomba",
      "DESCRIPTION": "Após receber um castigo de decorar e apresentar o discurso na aula de História, Chris espalha a notícia que tem uma bomba na escola para atrasar sua apresentação. Enquanto isso, uma cliente do salão de beleza não gostou da cor do seu cabelo e pede o dinheiro de volta; Rochelle diz que não, e então, a mulher lança uma macumba (vudu) sobre Rochelle.",
      "SEASON": 4,
      "NUMBER": 21
    },
    {
      "TITLE": "Todo Mundo Odeia O Supletivo",
      "DESCRIPTION": "Chris dá o melhor de si para evitar que chegue novamente atrasado na escola, mas ele chega atrasado graças ao professor Thurman, que quis que fosse assim. Se ele chegar atrasado mais uma vez, ele terá de repetir 1º ano do Ensino Médio. Quando repete, decide sair da escola e fazer o supletivo. Drew entra em um show de talentos no Apollo Theater, embora ele não tenha nenhum talento para mostrar. No final Chris e a família vão pra um restaurante, o pai dele chega com o resultado do supletivo e a série acaba sem dizer se Chris passou ou não no supletivo.\nNota: Quando Julius chega com seu caminhão, a câmera fecha até o número 735, que é pintada em seu caminhão. O número 735 era a pontuação de Chris, o que significa que ele não passou no Supletivo, considerando que a pontuação mínima para aprovação é 800.\nNota2: Quando Chris fala aos seus pais que fará o supletivo, ele cita Bill Cosby como um famoso que fez supletivo e se deu bem, Rochelle pede se ele quer ser comediante, igual ao Bill Cosby. Se prestar atenção, o que o Chris Rock se torna depois? Um comediante. Isso significa que ele não passou no supletivo e largou os estudos para se tornar comediante.",
      "SEASON": 4,
      "NUMBER": 22
    }
  ]
}